package com.cn.poker.admin.common.test;

public class Test {
    public static void main(String[] args) {
        String s = "新和村；桥头村；桥头新村；新田村；碧湖新村；念田村；美盛新村；海鲜市场；丽晶公司；新和1；2；3；4；5区；新兴工业区一；二；三；四；八区；富桥1；2；3；4；5；6区；雍景豪庭；永福大厦；鑫豪盛工业区AB区；永和大厦；兴华大厦；天瑞工业园；华发工业园；骏星工业区AB；旭竟昌工业园；祥利工业区；福发工业园；新福工业区；美盛工业区；大族激光；富尔达工业；安达科技；晖信工业区；万利达工业园；高新建工业区；德金工业区；德金时代广场；科比新工业园；骏丰工业园；双金惠工业区；世峰大厦；福海工业区A；B；C；D区；美希美工业园；红牌科技园；安泰工业园；华丽工业园；中阳商务大厦；聚宝工业区；大洋田；福安工业城；1；2；3期；怀德翠湖工业园；福方工业区；湖滨工业区；凤城花园1；2期；景山花园；旭飞花园；天佑工业区；福洲大道；同富裕路；重庆路；桥和路；风塘大道；桥塘路；建安路；永福路；永和路；蚝业路；福园一路；福园二路；新田大道；德兆花园；二；白石夏村；怀德村委；怀德大村；凤凰村；白石厦东区；白石厦西区；白石厦新开发区；新塘工业区；福永地税局；龙王庙工业区；农电工业区；农牧工业区；福永大道以北；福永镇府；西环路；政丰路；德丰路；福新街；金菊路；听涛雅苑一；二期；金域豪城；水禾田商务大厦；福永中心小学；福永中学；福永人民医院；福华大厦；谷威大厦；深彩大厦；永利大厦；龙翔山庄；龙翔北路；政丰北路；怀德北路；立新北路；立新小区（花园）；兴中宝电子城；福永第一；三工业区；福永第一工业区中信工业园；江氏大厦；兴益工业城；福永花苑；时代景苑；金石景苑；怀德翠岗第六工业区；怀德翠岗骏亿工业区；福永国际家居村；凤凰第一；二；三；四区；凤凰（兴围）第三工业区；城建工业区；凤凰东；西区；三；和平村；塘尾村；和顺村；玻璃围村；福霖大厦；深航幸福花园；永安居；幸福楼；领汇公寓；聚龙居；白领公寓；桥头小学；鸿德园；鹏福大酒店；来事达工业园；锐明工业园；蔚蓝工业园日东精密；福侨工业园；集成大厦；鸿辉大厦；荣信大厦；祥和工业园；淯源工业园；恒光耀工业园；怀德翠海工业园；光阳工业园；拓步工业园；高新技术工业园；福源工业区；富源工业区；福山工业区；鼎丰工业园；聚源工业园；塘尾第一工业区；富华工业区；联和盛工业园；爱默生工业园；正风工业园；西乡蚝业工业园；（福永大道以南是福永A区域；怀德新村属于福永A站）；虎背山怀德西部物流大厦；翔安酒店；安能物流园；塘尾爱默生工业园；友利公司；高士线业；伟创力公司";
        String[] split = s.split("；");
        for (String s1 : split) {
            System.out.println("::"+s1);
        }
    }
}
